/*
 
 
Описание задачи:

Ваша задача состоит в создании простого приложения, которое получает и отображает список книг из Open Library и позволяет пользователю просмотреть подробности о каждой книге.

Требования:

1 Приложение должно иметь главный экран, на котором отображается список книг, полученных из JSON API. Каждая книга должна отображать свой заголовок, дату первой публикации и обложку.
2 При нажатии на книгу в списке пользователь должен перейти на экран с подробной информацией о книге, включающей заголовок, описание, дату первой публикации, обложку и среднюю оценку пользователей.
3 Приложение должно иметь чистый и интуитивно понятный пользовательский интерфейс, соответствующий рекомендациям по человеко-машинному взаимодействию компании Apple.

Ограничения:

1 Приложение должно быть разработано на Swift и последней версии Xcode.
2 Приложение должно работать на iOS 13 и выше.
 
Оценка:

Мы оценим ваше решение на основе следующих критериев:
1 Полнота: Соответствует ли ваше решение указанным выше требованиям?
2 Качество кода: Является ли ваш код хорошо структурированным, модульным и поддерживаемым? Соответствует ли он конвенциям и лучшим практикам Swift?
3 Пользовательский интерфейс: Является ли интерфейс вашего приложения интуитивно понятным, легким в использовании и визуально привлекательным?
4 Сеть: Обрабатывает ли ваше приложение ошибки сети грамотно?
5 Производительность: Работает ли ваше приложение хорошо и быстро загружает данные?

Рекомендации по сдаче:

Пожалуйста, предоставьте решение в виде репозитория на GitHub, содержащего следующие компоненты:
1 Исходный код вашего приложения, включая необходимые конфигурации сборки.
2 Файл README, содержащий инструкции по сборке и запуску вашего приложения, а также любые заметки или комментарии, которые вы хотели бы включить о своей реализации.
3 Скриншоты или видео вашего приложения в действии.
4 Любые дополнительные заметки или комментарии, которые вы бы хотели включить о своей реализации.
Мы ожидаем, что выполнение задачи займет приблизительно 4-6 часов, но вы вольны потратить столько времени, сколько считаете нужным, чтобы выполнить задачу. Пожалуйста, сообщите нам, если у вас есть какие-либо вопросы или затруднения в выполнении задачи или сдаче решения.

Удачи!
 

Вставьте ссылку на GitHub с готовым ТЗ:
